# This script contains the following points:

#### 01. Import libraries
#### 02. Import data set 
#### 03. Explore new data set
#### 04. Merge 2 dataframes
#### 05. Export data in pickle format (pkl)

# 01. Import libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02. Import data set

In [2]:
# Set path
path = r'C:\Users\nang6\OneDrive\Bureau\Data Analytics\Data Immersion\Achievement 4\02-2020 Instacart Basket Analysis'

In [10]:
# Export 'orders_wrangled.csv'
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [14]:
# Export 'orders_products__prior.csv'
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products__prior.csv'), index_col = False)

 # 03. Explore 'orders_products__prior.csv'

In [15]:
# Check the first 5 rows

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [16]:
# Check the last 5 rows

df_ords_prior.tail()

          order_id  product_id  add_to_cart_order  reordered
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

In [17]:
# check size of df_ords_prior

df_ords_prior.shape

(32434489, 4)

In [43]:
# Comparing df_ords_prior with df_ords size

df_ords.shape

(3421083, 6)

# 04. Merge 2 dataframes

In [19]:
# Merge df_ords and df_ords_prior

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [35]:
# Check the first 5 rows

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [41]:
# Check sum up values in the _merge column

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

#### NOTE : Here we do not have a full match as the default option is  'inner' join, meaning that the resulting table will only contain observations found in both dataframes, as such, the merge flag here will only show entries that have a value of “both.”

#### Best practice is to always double-check your merge rates using an outer join using how = outer, as well, especially when you’re exploring new data and performing test merges.

In [33]:
# Check the first 5 rows

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [42]:
# Check size
df_merged_large.shape

(32434489, 10)

# 04. Export data to pkl

In [39]:
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))